### `CONCATENACIÓN DE DATAFRAMES CON PANDAS

In [20]:
import pandas as pd
import numpy as np

## `Ejercicio 1`

Crear 5 DataFrames

In [ ]:

filas_1 = ['F0','F1','F2','F3']
columnas_1 = ['C0','C1','C2','C3']
datos_1 = [['F0C0','F0C1','F0C2','F0C3'],
           ['F1C0','F1C1','F1C2','F1C3'],
           ['F2C0','F2C1','F2C2','F2C3'],
           ['F3C0','F3C1','F3C2','F3C3']]

df1 = pd.DataFrame(datos_1,index=filas_1,columns=columnas_1)
df1

      C0    C1    C2    C3
F0  F0C0  F0C1  F0C2  F0C3
F1  F1C0  F1C1  F1C2  F1C3
F2  F2C0  F2C1  F2C2  F2C3
F3  F3C0  F3C1  F3C2  F3C3

In [3]:

filas_2 = ['F4','F5','F6','F7']
columnas_2 = ['C0','C1','C2','C3']
datos_2 = [['F4C0','F4C1','F4C2','F4C3'],
           ['F5C0','F5C1','F5C2','F5C3'],
           ['F6C0','F6C1','F6C2','F6C3'],
           ['F7C0','F7C1','F7C2','F7C3']]

df2 = pd.DataFrame(datos_2,index=
filas_2,columns=columnas_2)
df2

      C0    C1    C2    C3
F4  F4C0  F4C1  F4C2  F4C3
F5  F5C0  F5C1  F5C2  F5C3
F6  F6C0  F6C1  F6C2  F6C3
F7  F7C0  F7C1  F7C2  F7C3

In [4]:
filas_3 = ['F8','F9','F10','F11']
columnas_3 = ['C0','C1','C2','C3']
datos_3 = [['F8C0','F8C1','F8C2','F8C3'],
           ['F9C0','F9C1','F9C2','F9C3'],
           ['F10C0','F10C1','F10C2','F10C3'],
           ['F11C0','F11C1','F11C2','F11C3']]

df3 = pd.DataFrame(datos_3,index=filas_3,columns=columnas_3)
df3

        C0     C1     C2     C3
F8    F8C0   F8C1   F8C2   F8C3
F9    F9C0   F9C1   F9C2   F9C3
F10  F10C0  F10C1  F10C2  F10C3
F11  F11C0  F11C1  F11C2  F11C3

In [5]:
filas_4 = ['F2','F3','F7','F8']
columnas_4 = ['C2','C3','C6']
datos_4 = [['F2C2','F2C3','F2C6'],
           ['F3C1','F3C3','F3C6'],
           ['F7C1','F7C3','F7C6'],
           ['F8C1','F8C3','F8C6']]

df4 = pd.DataFrame(datos_4,index=filas_4,columns=columnas_4)
df4

      C2    C3    C6
F2  F2C2  F2C3  F2C6
F3  F3C1  F3C3  F3C6
F7  F7C1  F7C3  F7C6
F8  F8C1  F8C3  F8C6

In [6]:
filas_5 = ['F2','F3','F7','F8']
columnas_5 = ['C5','C6','C7']
datos_5 = [['F2C5','F2C3','F2C7'],
           ['F3C5','F3C3','F3C7'],
           ['F7C5','F7C3','F7C7'],
           ['F8C5','F8C3','F8C7']]           



df5 = pd.DataFrame(datos_5,index=filas_5,columns=columnas_5)
df5

      C5    C6    C7
F2  F2C5  F2C3  F2C7
F3  F3C5  F3C3  F3C7
F7  F7C5  F7C3  F7C7
F8  F8C5  F8C3  F8C7

### `Método Concatenate()`

 * `objs:` la lista de Data Frames a concantenar.
 * `axis:` 0 para filas y 1 para columnas.
 * `join:` "outer" union, "inner" intersección.
 * Si se ignora el indice, se genera uno nuevo. 

Sintaxis: pd.`concatenate`(objs, axis=0, join="outer", ignore_index=False)

## `Ejercicio 2`

Concatene los DataFrames df1, df2, df3

In [7]:
concatenar = pd.concat([df1, df2, df3])
concatenar

        C0     C1     C2     C3
F0    F0C0   F0C1   F0C2   F0C3
F1    F1C0   F1C1   F1C2   F1C3
F2    F2C0   F2C1   F2C2   F2C3
F3    F3C0   F3C1   F3C2   F3C3
F4    F4C0   F4C1   F4C2   F4C3
F5    F5C0   F5C1   F5C2   F5C3
F6    F6C0   F6C1   F6C2   F6C3
F7    F7C0   F7C1   F7C2   F7C3
F8    F8C0   F8C1   F8C2   F8C3
F9    F9C0   F9C1   F9C2   F9C3
F10  F10C0  F10C1  F10C2  F10C3
F11  F11C0  F11C1  F11C2  F11C3

## `Ejercicio 3`

Intersecte las columnas del DataFrame df1, df4 utilizando axis = 1 para columnas y join inner

In [8]:
# al utilizar join inner solo hace la concatenación con las filas en comun en este caso con F2 y F3
concat_inner = pd.concat([df1, df4], axis=1, join="inner")
concat_inner

      C0    C1    C2    C3    C2    C3    C6
F2  F2C0  F2C1  F2C2  F2C3  F2C2  F2C3  F2C6
F3  F3C0  F3C1  F3C2  F3C3  F3C1  F3C3  F3C6

## `Ejercicio 4`

Intersecte las columnas del DataFrame df1, df4 utilizando axis = 1 para columnas y join outer

In [9]:
# al utilizar join outer hace la concatenación con todas las filas 
concat_outer = pd.concat([df1, df4], axis=1, join="outer")
concat_outer

      C0    C1    C2    C3    C2    C3    C6
F0  F0C0  F0C1  F0C2  F0C3   NaN   NaN   NaN
F1  F1C0  F1C1  F1C2  F1C3   NaN   NaN   NaN
F2  F2C0  F2C1  F2C2  F2C3  F2C2  F2C3  F2C6
F3  F3C0  F3C1  F3C2  F3C3  F3C1  F3C3  F3C6
F7   NaN   NaN   NaN   NaN  F7C1  F7C3  F7C6
F8   NaN   NaN   NaN   NaN  F8C1  F8C3  F8C6

## `Ejercicio 5`

Utilizar el indice de alguno de los DataFrame df1, df4 con el metodoreindex()

In [10]:
concat_index = pd.concat([df1, df4], axis=1).reindex(df1.index)
concat_index

      C0    C1    C2    C3    C2    C3    C6
F0  F0C0  F0C1  F0C2  F0C3   NaN   NaN   NaN
F1  F1C0  F1C1  F1C2  F1C3   NaN   NaN   NaN
F2  F2C0  F2C1  F2C2  F2C3  F2C2  F2C3  F2C6
F3  F3C0  F3C1  F3C2  F3C3  F3C1  F3C3  F3C6

### `2.- UNION DE DATAFRAMES CON PANDAS(INNER, OUTER, RIGHT, LEFT JOIN)`

Podemos unir o fusionar DataFrames en pandas con python usando la funcion `merge()`, los diferentes argumentos para `merge()` le permiten realizar una unión natural, unión izquierda, unión derecha, unión externa.

### `SINTAXIS: `

`pd.merge(left_df1, right_df2, how="inner", on=None, left_on=None,right_on=None, sort=True, indicator=False)`

### Donde:

* `left_df1, right_df2` : Son los DataFrames

* `how`: left, right, outer, inner indica que tipo de combinación se va a utilizar, el valor predeterminada es inner.<br>
       - `inner:` Mantiene solo las filas que coinciden con los marcos de datos.<br>
       - `outer:` Mantiene todas las Filas de ambos Marcos de Trabajo<br>
       - `left:` Para incluir todas las filas tanto de xy y solo las de y que coinciden<br>
       - `right:` Incluir todas las filas del marcho y y solo las de x que conciden<br>

* `on, left_on, right_on`: Columna que se utilizara como clave
* `sort`: ordena el DF resultane por la columna clave
* `indicator`: añade una columna que indica la procedencia de cada fila

### `Ejercicio 1`
crear dos dataframes

In [27]:
# ---- Data Frame 1 ----

datos_1 = {
    'id':pd.Series([1,2,3,4,5,6]),
    'producto': pd.Series(['Teclado','Radio','Laptop','Televisión','Refrigerador','Leche'])
}

df_1 = pd.DataFrame(datos_1)
df_1

   id      producto
0   1       Teclado
1   2         Radio
2   3        Laptop
3   4    Televisión
4   5  Refrigerador
5   6         Leche

In [28]:
# ---- Data Frame 2 ----

datos_2 = {
    'id':pd.Series([2, 4, 6, 7, 8]),
    'precio': pd.Series([100, 200, 300, 400, 500])
}

df_2 = pd.DataFrame(datos_2)
df_2

   id  precio
0   2     100
1   4     200
2   6     300
3   7     400
4   8     500

## `Ejercicio 7`

### Inner Join(Union Interna)

Devulve solo las filas en las que la tabla izquierda tienen claves concidentes en la tabla derecha

In [29]:
inner_join = pd.merge(df_1, df_2, on='id', how='inner')
inner_join

   id    producto  precio
0   2       Radio     100
1   4  Televisión     200
2   6       Leche     300

## `Ejercicio 8`

### Outer Join(Union Externa)

Devuelve todas las filas de ambas tabla, une los registros de la tabla izquierda con la tabla derecha, cuando no hay
coincidentes en ninguna tabla se devolvera NaN

In [30]:
outer_join = pd.merge(df_1, df_2, on='id', how='outer')
outer_join

   id      producto  precio
0   1       Teclado     NaN
1   2         Radio   100.0
2   3        Laptop     NaN
3   4    Televisión   200.0
4   5  Refrigerador     NaN
5   6         Leche   300.0
6   7           NaN   400.0
7   8           NaN   500.0

## `Ejercicio 9`

### Left Join(Union Externa Izquierda)

Devuelve todas las filas de la tabla izquierda, y todas las filas con clave coincidentes de la tabla derecha, cuando no hay
coincidentes en la tabla derecha se devolvera NaN

In [31]:
# left join

left_join = pd.merge(df_1,df_2, on='id', how='left')
left_join

   id      producto  precio
0   1       Teclado     NaN
1   2         Radio   100.0
2   3        Laptop     NaN
3   4    Televisión   200.0
4   5  Refrigerador     NaN
5   6         Leche   300.0

## `Ejercicio 10`

### Right Join(Union Externa Derecha)

Devuelve todas las filas de la tabla derecha, y todas las filas con clave coincidentes de la tabla izquierda, cuando no hay
coincidentes en la tabla izquierda se devolvera NaN

In [32]:
right_join = pd.merge(df_1, df_2, on='id', how='right')
right_join

   id    producto  precio
0   2       Radio     100
1   4  Televisión     200
2   6       Leche     300
3   7         NaN     400
4   8         NaN     500